In [39]:
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
import pandas as pd

In [40]:
engine = create_engine("sqlite:///./resources/data.sqlite")
Base = declarative_base()
Base.metadata.create_all(engine)

In [41]:
result_set = engine.execute("SELECT * FROM tv_show")
keys = result_set.keys()

In [42]:
df = pd.DataFrame(result_set)
df

   0                       1                2    3
0  1          Dogs With Hats           comedy   20
1  2  Selling Haunted Houses          (>^-^)>  100
2  3           Bob's Burgers  animated comedy  150

In [43]:
col_names = {}
for i in range(len(keys)):
    col_names[i] = keys[i]
col_names

{0: 'id', 1: 'name', 2: 'genre', 3: 'episodes'}

In [44]:
df

   0                       1                2    3
0  1          Dogs With Hats           comedy   20
1  2  Selling Haunted Houses          (>^-^)>  100
2  3           Bob's Burgers  animated comedy  150

In [45]:
df.rename(columns=col_names, inplace=True)
df.set_index("id", inplace=True)
df

                      name            genre  episodes
id
1           Dogs With Hats           comedy        20
2   Selling Haunted Houses          (>^-^)>       100
3            Bob's Burgers  animated comedy       150